Revit 2027 API
ViewDisplayDepthCueing.SetStartEndPercentages Method
 Sets start and end percentages.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStartEndPercentages(
	int startPercentage,
	int endPercentage
)
Public Sub SetStartEndPercentages (
	startPercentage As Integer,
	endPercentage As Integer
)
public:
void SetStartEndPercentages(
	int startPercentage,
	int endPercentage
)
member SetStartEndPercentages :
        startPercentage : int *
        endPercentage : int -> unit
Parameters
startPercentage Int32
 The start percentage defines where depth cueing starts.
endPercentage Int32
 The end percentage defines where depth cueing ends.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The start and end percentages values are not valid. The valid range is 0 to 100 and start is smaller than end.
See Also
Reference
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace